# SpaceTagType Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpaceTagType Class
Members See Also
---
An object that represents a Space Tag style.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class SpaceTagType : FamilySymbol
```

Visual Basic
---
```text
Public Class SpaceTagType _
	Inherits FamilySymbol
```

Visual C++
---
```text
public ref class SpaceTagType : public FamilySymbol
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB..::..InsertableObject Autodesk.Revit.DB..::..FamilySymbol Autodesk.Revit.DB.Mechanical..::..SpaceTagType
# See Also
SpaceTagType Members
Autodesk.Revit.DB.Mechanical Namespace